{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional_1",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                1165,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_2"
                        },
                        "name": "input_layer_2",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                771,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_3"
                        },
                        "name": "input_layer_3",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Bidirectional",
                        "config": {
                            "name": "bidirectional_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "merge_mode": "concat",
                            "layer": {
                                "module": "keras.layers",
                                "class_name": "LSTM",
                                "config": {
                                    "name": "forward_lstm_2",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": false,
                                    "stateful": false,
                                    "unroll": false,
                                    "zero_output_for_mask": false,
                                    "units": 128,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "recurrent_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "seed": null,
                                            "gain": 1.0
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "seed": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        1165,
                                        1
                                    ]
                                }
                            },
                            "backward_layer": {
                                "module": "keras.layers",
                                "class_name": "LSTM",
                                "config": {
                                    "name": "backward_lstm_2",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": true,
                                    "stateful": false,
                                    "unroll": false,
                                    "zero_output_for_mask": false,
                                    "units": 128,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "recurrent_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "seed": null,
                                            "gain": 1.0
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "seed": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        1165,
                                        1
                                    ]
                                }
                            }
                        },
                        "name": "bidirectional_2",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                1165,
                                                1
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "input_layer_2",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "Bidirectional",
                        "config": {
                            "name": "bidirectional_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "merge_mode": "concat",
                            "layer": {
                                "module": "keras.layers",
                                "class_name": "LSTM",
                                "config": {
                                    "name": "forward_lstm_3",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": false,
                                    "stateful": false,
                                    "unroll": false,
                                    "zero_output_for_mask": false,
                                    "units": 128,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "recurrent_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "seed": null,
                                            "gain": 1.0
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "seed": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        771,
                                        1
                                    ]
                                }
                            },
                            "backward_layer": {
                                "module": "keras.layers",
                                "class_name": "LSTM",
                                "config": {
                                    "name": "backward_lstm_3",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "return_sequences": false,
                                    "return_state": false,
                                    "go_backwards": true,
                                    "stateful": false,
                                    "unroll": false,
                                    "zero_output_for_mask": false,
                                    "units": 128,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "recurrent_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "seed": null,
                                            "gain": 1.0
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "seed": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        771,
                                        1
                                    ]
                                }
                            }
                        },
                        "name": "bidirectional_3",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                771,
                                                1
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "input_layer_3",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "Lambda",
                        "config": {
                            "name": "lambda_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "function": {
                                "module": "builtins",
                                "class_name": "function",
                                "config": "Custom>compute_similarity",
                                "registered_name": "function"
                            },
                            "arguments": {}
                        },
                        "name": "lambda_1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    [
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    256
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "bidirectional_2",
                                                    0,
                                                    0
                                                ]
                                            }
                                        },
                                        {
                                            "class_name": "__keras_tensor__",
                                            "config": {
                                                "shape": [
                                                    null,
                                                    256
                                                ],
                                                "dtype": "float32",
                                                "keras_history": [
                                                    "bidirectional_3",
                                                    0,
                                                    0
                                                ]
                                            }
                                        }
                                    ]
                                ],
                                "kwargs": {
                                    "mask": [
                                        null,
                                        null
                                    ]
                                }
                            }
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_layer_2",
                        0,
                        0
                    ],
                    [
                        "input_layer_3",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "lambda_1",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "forward_lstm_2/lstm_cell/kernel",
                    "shape": [
                        1,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "forward_lstm_2/lstm_cell/recurrent_kernel",
                    "shape": [
                        128,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "forward_lstm_2/lstm_cell/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "backward_lstm_2/lstm_cell/kernel",
                    "shape": [
                        1,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "backward_lstm_2/lstm_cell/recurrent_kernel",
                    "shape": [
                        128,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "backward_lstm_2/lstm_cell/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "forward_lstm_3/lstm_cell/kernel",
                    "shape": [
                        1,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "forward_lstm_3/lstm_cell/recurrent_kernel",
                    "shape": [
                        128,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "forward_lstm_3/lstm_cell/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "backward_lstm_3/lstm_cell/kernel",
                    "shape": [
                        1,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "backward_lstm_3/lstm_cell/recurrent_kernel",
                    "shape": [
                        128,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "backward_lstm_3/lstm_cell/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}